### Coding：缺失数据、重复数据、字符串操作和数据转换

> ### **Question**

### 1.1 处理缺失数据

In [4]:
import numpy as np
import pandas as pd

string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

> ### 关于缺失处理的函数

   - **dropna**: 根据各标签的值中是否存在缺失数据对轴标签进行过滤，可通过阈值调节对缺失值的容忍度
   - **fillna**：用指定值或插值方法（ffill或bfill）填充缺失数据
   - **isnull**：返回一个含有布尔值的对象，这些布尔值表示该值是否为缺失值NA，该对象的类型与源类型一样
   - **notnull**：isnull的否定式

> ### 滤除缺失数据

In [17]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

- 对于一个**Series**，**dropna**返回一个仅含**非空数据**和**索引值**的**Series**

In [7]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
print(data)
data.dropna()

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

0    1.0
2    3.5
4    7.0
dtype: float64

- 等价于

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],\
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()  # dropna默认丢弃任何含有缺失值的行
print(data)
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how='all') # how='all'将只丢弃全为NA的那些行

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = NA
print(data)
data.dropna(axis=1, how='all')  # axis=1只丢弃列

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
print(df)
df.dropna()

          0         1         2
0 -0.846260       NaN       NaN
1 -0.711787       NaN       NaN
2 -0.203661       NaN -0.550481
3  0.664282       NaN -0.159743
4 -0.167209  0.613369  0.906563
5  0.999521  1.152945  2.394519
6 -1.190758  0.962671  0.465752

          0         1         2
4 -0.167209  0.613369  0.906563
5  0.999521  1.152945  2.394519
6 -1.190758  0.962671  0.465752

In [16]:
print(df)
df.dropna(thresh=2)  # thresh 删除指定阈值

          0         1         2
0 -0.846260       NaN       NaN
1 -0.711787       NaN       NaN
2 -0.203661       NaN -0.550481
3  0.664282       NaN -0.159743
4 -0.167209  0.613369  0.906563
5  0.999521  1.152945  2.394519
6 -1.190758  0.962671  0.465752

          0         1         2
2 -0.203661       NaN -0.550481
3  0.664282       NaN -0.159743
4 -0.167209  0.613369  0.906563
5  0.999521  1.152945  2.394519
6 -1.190758  0.962671  0.465752

> ### 填充缺失数据

In [18]:
df.fillna(0)  # fillna就会将缺失值替换为那个常数值

          0         1         2
0 -0.846260  0.000000  0.000000
1 -0.711787  0.000000  0.000000
2 -0.203661  0.000000 -0.550481
3  0.664282  0.000000 -0.159743
4 -0.167209  0.613369  0.906563
5  0.999521  1.152945  2.394519
6 -1.190758  0.962671  0.465752

In [19]:
df.fillna({1: 0.5, 2: 0})  # 通过一个字典调用fillna，就可以实现对不同的列填充不同的值

          0         1         2
0 -0.846260  0.500000  0.000000
1 -0.711787  0.500000  0.000000
2 -0.203661  0.500000 -0.550481
3  0.664282  0.500000 -0.159743
4 -0.167209  0.613369  0.906563
5  0.999521  1.152945  2.394519
6 -1.190758  0.962671  0.465752

In [23]:
_ = df.fillna(0, inplace=True)  # fillna默认会返回新对象，但也可以对现有对象进行就地修改
df

          0         1         2
0 -0.846260  0.000000  0.000000
1 -0.711787  0.000000  0.000000
2 -0.203661  0.000000 -0.550481
3  0.664282  0.000000 -0.159743
4 -0.167209  0.613369  0.906563
5  0.999521  1.152945  2.394519
6 -1.190758  0.962671  0.465752

In [24]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.183448 -1.272115  0.251656
1  1.457184  0.106580  1.457382
2  1.313901       NaN -1.159730
3  0.705313       NaN  0.758216
4 -0.737859       NaN       NaN
5  1.030461       NaN       NaN

In [25]:
df.fillna(method='ffill')

          0         1         2
0  0.183448 -1.272115  0.251656
1  1.457184  0.106580  1.457382
2  1.313901  0.106580 -1.159730
3  0.705313  0.106580  0.758216
4 -0.737859  0.106580  0.758216
5  1.030461  0.106580  0.758216

In [26]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.183448 -1.272115  0.251656
1  1.457184  0.106580  1.457382
2  1.313901  0.106580 -1.159730
3  0.705313  0.106580  0.758216
4 -0.737859       NaN  0.758216
5  1.030461       NaN  0.758216

In [27]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())  # 传入Series的平均值或中位数

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### 1.2 数据转换

> ### 移除重复数据

In [28]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],\
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [29]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
data.drop_duplicates()  # DataFrame的duplicated方法返回一个布尔型Series，表示各行是否是重复行

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])  # drop_duplicates方法，它会返回一个DataFrame，重复的数组会标为False
# 指定部分列进行重复项判断

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
# duplicated和drop_duplicates默认保留的是第一个出现的值组合。传入
# keep='last'则保留最后一个
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

> ### 利用函数和映射进行数据转换

In [34]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',\
                              'Pastrami', 'corned beef', 'Bacon',\
                              'pastrami', 'honey ham', 'nova lox'],\
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

##### Series的map方法可以接受一个函数或含有映射关系的字典型对象

In [35]:
meat_to_animal = {
  'bacon': 'pig',\
  'pulled pork': 'pig',\
  'pastrami': 'cow',\
  'corned beef': 'cow',\
  'honey ham': 'pig',\
  'nova lox': 'salmon'
}

In [36]:
lowercased = data['food'].str.lower() # lower方法 将各个值转换为小写
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [37]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

- **使用map是一种实现元素级转换以及其他数据清理工作的便捷方式**

In [38]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

> ### 替换值情况

In [39]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [40]:
data.replace(-999, np.nan)  # 利用replace来产生一个新的Series

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [41]:
data.replace([-999, -1000], np.nan)  # 一次性替换多个值，可以传入一个由待替换值组成的列表以及一个替换值

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [42]:
data.replace([-999, -1000], [np.nan, 0])  # 要让每个值有不同的替换值，可以传递一个替换列表

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [43]:
data.replace({-999: np.nan, -1000: 0})  # 传入的参数可以为字典形式

# data.replace方法与data.str.replace不同，后者做的是字符串的元素级替换

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

> ### 重命名轴索引

> **轴标签也可以通过函数或映射进行转换，从而得到一个新的
不同标签的对象**

In [44]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),\
                    index=['Ohio', 'Colorado', 'New York'],\
                    columns=['one', 'two', 'three', 'four'])

In [45]:
data  #轴还可以被就地修改，而无需新建一个数据结构

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [46]:
transform = lambda x: x[:4].upper()
data.index.map(transform)  # 轴索引有一个map方法

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [47]:
data.index = data.index.map(transform)  # 对DataFrame进行修改
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [48]:
data.rename(index=str.title, columns=str.upper)  # rename 创建数据集的转换

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [49]:
data.rename(index={'OHIO': 'INDIANA'},\
            columns={'three': 'peekaboo'}) # rename可以结合字典型对象实现对部分轴标签的更新

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [50]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)  # rename可以实现复制DataFrame并对其索引和列标签进行赋值
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

> ### 离散化 和 面元(bin)划分

> **连续数据的离散化或面元操作**

In [51]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [53]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats  # pandas返回的是一个特殊的Categorical对象

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [54]:
cats.codes  # pandas返回的是一个特殊的Categorical对象  年龄数据的标签

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [55]:
cats.categories  # 表示不同分类名称的类型数组

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [56]:
# pd.value_counts(cats)是pandas.cut结果的面元计数pd.value_counts(cats)  #

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [57]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)  # （）表示开端，而[]则表示闭端

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [58]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']  # 过传递一个列表或数组到labels，设置自己的面元名称
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [59]:
# 如果向cut传入的是面元的数量而不是确切的面元边界，则它会根据数据的最小值和最大值计算等长面元
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.26, 0.5], (0.016, 0.26], (0.74, 0.98], (0.016, 0.26], (0.016, 0.26], ..., (0.26, 0.5], (0.26, 0.5], (0.26, 0.5], (0.26, 0.5], (0.016, 0.26]]
Length: 20
Categories (4, interval[float64]): [(0.016, 0.26] < (0.26, 0.5] < (0.5, 0.74] < (0.74, 0.98]]

In [60]:
# qcut是一个非常类似于cut的函数，它可以根据样本分位数对数据进行面元划分。
# 根据数据的分布情况，cut可能无法使各个面元中含有相同数量的数据点。而qcut由于使用的是样本分位数，因此可以得到大小基本相等的面元
data = np.random.randn(1000)  # 正态分布
cats = pd.qcut(data, 4)  # 剔除奇异值
print(cats)
pd.value_counts(cats)

[(-0.0177, 0.651], (0.651, 3.719], (-0.0177, 0.651], (-0.0177, 0.651], (-0.676, -0.0177], ..., (-3.239, -0.676], (0.651, 3.719], (-0.0177, 0.651], (0.651, 3.719], (-3.239, -0.676]]
Length: 1000
Categories (4, interval[float64]): [(-3.239, -0.676] < (-0.676, -0.0177] < (-0.0177, 0.651] < (0.651, 3.719]]

(0.651, 3.719]       250
(-0.0177, 0.651]     250
(-0.676, -0.0177]    250
(-3.239, -0.676]     250
dtype: int64

In [61]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]) # 与cut类似，你也可以传递自定义的分位数——0到1之间的数值，包含端点

[(-0.0177, 1.265], (1.265, 3.719], (-0.0177, 1.265], (-0.0177, 1.265], (-1.347, -0.0177], ..., (-1.347, -0.0177], (-0.0177, 1.265], (-0.0177, 1.265], (-0.0177, 1.265], (-1.347, -0.0177]]
Length: 1000
Categories (4, interval[float64]): [(-3.239, -1.347] < (-1.347, -0.0177] < (-0.0177, 1.265] < (1.265, 3.719]]

### 结合聚合和分组运算的cut和qcut操作

> ### 检测 和 过滤异常值

> #### 过滤或变换异常值（outlier）在很大程度上就是运用数组运算

In [62]:
# 正态分布数据的DataFrame
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.021888    -0.017801    -0.022342     0.005433
std       1.021156     1.021771     0.941071     0.969385
min      -3.309342    -3.135185    -2.796993    -3.646238
25%      -0.667876    -0.701330    -0.608031    -0.674100
50%      -0.039186    -0.058085     0.006290    -0.014143
75%       0.650227     0.689485     0.606105     0.706154
max       2.951909     3.653240     3.275137     3.215001

In [63]:
col = data[2]
col[np.abs(col) > 3]  # 找出某列中绝对值大小超过3的值

557    3.275137
Name: 2, dtype: float64

In [64]:
data[(np.abs(data) > 3).any(1)] # 选出全部含有“超过3或－3的值”的行

            0         1         2         3
100 -0.972203 -3.135185  0.133363  0.393458
131 -0.670976 -0.888269 -2.384384  3.215001
255 -3.233538  1.695140 -1.494032  0.502536
456 -0.040251 -3.004396  0.649130 -1.009659
478 -3.007039 -0.308686  0.901122  1.454375
482 -0.406284  3.215452  0.713956 -0.376468
522 -0.201670  1.182955 -1.394596 -3.646238
539 -3.184047  0.812148 -0.199909 -0.249664
557 -0.539113 -2.590413  3.275137 -0.747545
605 -3.309342 -0.735712 -0.501959  0.755412
612  1.131295 -0.925048 -0.397777  3.186220
720 -0.127148  3.037996  0.233700 -1.068696
939 -0.332097 -0.494179 -1.413364 -3.318063
975  0.400213  3.653240 -0.190988 -0.800789

In [65]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe() # 将值限制在区间－3到3

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.021154    -0.018568    -0.022617     0.005996
std       1.018920     1.018435     0.940146     0.964831
min      -3.000000    -3.000000    -2.796993    -3.000000
25%      -0.667876    -0.701330    -0.608031    -0.674100
50%      -0.039186    -0.058085     0.006290    -0.014143
75%       0.650227     0.689485     0.606105     0.706154
max       2.951909     3.000000     3.000000     3.000000

In [66]:
np.sign(data).head()  # 指示函数 np.sign(data)可以生成1和-1

     0    1    2    3
0  1.0 -1.0 -1.0  1.0
1 -1.0 -1.0  1.0 -1.0
2  1.0  1.0  1.0 -1.0
3 -1.0 -1.0 -1.0 -1.0
4  1.0 -1.0 -1.0 -1.0

> ### 排列 和 随机采样

> ### 利用numpy.random.permutation函数可以轻松实现对Series或DataFrame的列的排列工作，即permuting 随机排序

In [67]:
# 通过需要排列的轴的长度调用permutation，可产生一个表示新顺序的整数数组
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
# print(df)
sampler = np.random.permutation(5)
sampler

array([0, 4, 1, 2, 3])

In [68]:
print(df)
df.take(sampler) # 在基于iloc的索引操作或take函数中使用该数组

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [69]:
df.sample(n=3)  # 在Series和DataFrame上使用sample方法

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7

In [70]:
# 要通过替换的方式产生样本（允许重复选择），可以传递replace=True到sample
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

3    6
0    5
1    7
2   -1
1    7
2   -1
1    7
3    6
1    7
3    6
dtype: int64

> ### 计算指标和哑变量

> #### 将分类变量（categoricalvariable）转换为“哑变量”或“指标矩阵”

In [71]:
# 如果DataFrame的某一列中含有k个不同的值，则可以派生出一个k列矩阵或DataFrame（其值全为1和0）
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],\
                   'data1': range(6)})
pd.get_dummies(df['key'])  # get_dummies函数的功能

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [72]:
# 给指标DataFrame的列加上一个前缀，以便能够跟其他数据进行合并
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy # get_dummies的prefix功能

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [73]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',\
                       header=None, names=mnames)
movies[:10]

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [74]:
# 从数据集中抽取出不同的genre值
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)

In [75]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [76]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres) # 全零DataFrame

In [77]:
# 迭代每一部电影，并将dummies各行的条目设为1
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [78]:
# 根据索引，使用.iloc设定值
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [79]:
# 将其与movies合并
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [80]:
# 结合get_dummies和诸如cut之类的离散化函数
np.random.seed(12345)
values = np.random.rand(10)
print(values)
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

[0.92961609 0.31637555 0.18391881 0.20456028 0.56772503 0.5955447
 0.96451452 0.6531771  0.74890664 0.65356987]

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

### 1.3 字符串操作：对整组数据应用字符串表达式和正则表达式

> ### 字符串对象方法

In [81]:
# 以逗号分隔的字符串可以用split拆分成数段
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [1]:
# 以逗号分隔的字符串可以用split拆分成数段
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [2]:
# split常常与strip一起使用，以去除空白符（包括换行符）
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [3]:
# 利用加法，可以将这些子字符串以双冒号分隔符的形式连接起来
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

##### 向字符串"::"的join方法传入一个列表或元组

In [4]:
'::'.join(pieces)

'a::b::guido'

#### 检测子串的最佳方式是利用Python的in关键字，还可以使用index和find

#### find和index的区别：如果找不到字符串，index将会引发一个异常（而不是返回－1）

In [5]:
'guido' in val
val.index(',')

1

In [6]:
val.find(':')

-1

In [88]:
# count可以返回指定子串的出现次数
val.count(',')

2

In [89]:
# replace用于将指定模式替换为另一个模式。通过传入空字符串，它也常常用于删除模式
val.replace(',', '::')

'a::b::  guido'

In [90]:
val.replace(',', '')

'ab  guido'

> ### 正则表达式（regex）：通过在文本中搜索或匹配字符串模式

> #### 模式匹配

> #### 替换

> #### 拆分

In [91]:
import re
text = "foo    bar\t baz  \tqux"
# 描述一个或多个空白符的regex是\s+
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

### 调用re.split('\s+',text)时，正则表达式会先被编译，然后再在text上调用其split方法。

### 用re.compile自己编译regex以得到一个可重用的regex对象

In [92]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [93]:
regex.findall(text) # 使用findall方法得到匹配regex的所有模式

['    ', '\t ', '  \t']

### 如果想避免正则表达式中不需要的转义（\），则可以使用原始字符串字面量如r''

In [94]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# 不区分大小写
regex = re.compile(pattern, flags=re.IGNORECASE)

In [96]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

### findall返回的是字符串中所有的匹配项，而search则只返回第一个匹配项，match只匹配字符串的首部

In [97]:
m = regex.search(text) #  search返回的是文本中第一个电子邮件地址 
print(m)
text[m.start():m.end()]

<_sre.SRE_Match object; span=(5, 20), match='dave@google.com'>

'dave@google.com'

In [98]:
print(regex.match(text)) # regex.match则将返回None，因为它只匹配出现在字符串开头的模式

None

In [99]:
print(regex.sub('REDACTED', text)) # ub方法可以将匹配到的模式替换为指定字符串，并返回所得到的新字符串

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [100]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [101]:
m = regex.match('wesm@bright.net')  # 通过其groups方法返回一个由模式各段组成的元组
m.groups()

('wesm', 'bright', 'net')

In [102]:
regex.findall(text)  # 对于带有分组功能的模式，findall会返回一个元组列表

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [103]:
# sub还能通过诸如\1、\2之类的特殊符号访问各匹配项中的分组。符号\1对应第一个匹配的组，\2对应第二个匹配的组
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

> ### pandas的矢量化字符串函数：处理含有字符串的列时，含有缺失数据的情况

In [104]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',\
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
print(data)
data.isnull()

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

Dave     False
Rob      False
Steve    False
Wes       True
dtype: bool

In [105]:
data.str.contains('gmail') # 通过str.contains检查各个电子邮件地址是否含有"gmail"

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object

In [106]:
print(pattern)
data.str.findall(pattern, flags=re.IGNORECASE)

([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})

Dave     [(dave, google, com)]
Rob        [(rob, gmail, com)]
Steve    [(steve, gmail, com)]
Wes                        NaN
dtype: object

> ### 使用str.get

> ### 在str属性上使用索引

In [107]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Rob      True
Steve    True
Wes       NaN
dtype: object

In [108]:
# 要访问嵌入列表中的元素，我们可以传递索引到这两个函数中
matches.str.get(1)
matches.str[0]

Dave    NaN
Rob     NaN
Steve   NaN
Wes     NaN
dtype: float64

> ### 对字符串进行截取操作

In [109]:
data.str[:5]

Dave     dave@
Rob      rob@g
Steve    steve
Wes        NaN
dtype: object

### Conclusion

> #### 数据清洗和准备是数据预处理的关键步骤，高效的数据准备可以将更多的时间用于数据分析，模型构建、模型评估、模型调参和算法优化等方面。